Revit 2027 API
StructuralAssetFailures Properties
The BuiltInFailures.StructuralAssetFailures type exposes the following members.
Properties
Name | Description
StructuralMaterialAssetInvalid |  Material assigned to the Analytical Element does not contain Structure parameters - verify material content.
Top
See Also
Reference
BuiltInFailures.StructuralAssetFailures Class
Autodesk.Revit.DB Namespace